brew "asdf"
brew "tailscale"
brew "zsh-vi-mode"
brew "zellij"
brew "argocd"
brew "minikube"
brew "pulumi"
brew "gettext"
brew "watch"
brew "readline"
brew "openssl"
brew "neovim"
brew "fzf"
brew "bat"
brew "git-delta"
brew "ripgrep"
brew "k9s"
brew "z"
brew "gnupg"
brew "jq"
brew "yq"
cask "aws-vault"  # See Crowbar below
brew "awscli"
cask "iterm2"
cask "todoist"
cask "fantastical"
brew "starship"
brew "wget"
brew "ffmpeg"
brew "solargraph"  # for ruby lsp
brew "dive"  # container exploration
brew "imagemagick"
# cask "firefox"  # Easier to just install it myself for now

# nvim ale/lsp stuff
brew "shellcheck"
brew "shfmt"

# yadm (note: yadm will always be installed first as the first yadm bootstrap command necessarily requires a
# pre-existing yadm command)
brew "yadm"

# Stuff to be pretty
brew "cowsay"
brew "lolcat"
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"

#github integration
brew "gh"
brew "cmake"  # needed for a dependency, telescope-fzf-native.nvim

# Docker for Mac
# brew "docker"
# brew "docker-compose"
# cask "docker"

# Hashicorp Vault
tap "hashicorp/tap"
brew "hashicorp/tap/vault"

# blumeops
brew "aws-iam-authenticator"
