brew "mas"
brew "asdf"
brew "pipx"
brew "ykman"  # yubikey
brew "tailscale"
cask "protonmail-bridge"
brew "zsh-vi-mode"
brew "zellij"
brew "gettext"
brew "watch"
brew "zsh-autosuggestions"
brew "readline"
brew "openssl"
brew "neovim"
brew "fzf"
brew "bat"
brew "git-delta"
brew "ripgrep"
brew "z"
brew "gnupg"
brew "jq"
brew "yq"
cask "aws-vault"
brew "awscli"
cask "iterm2"
cask "todoist"
brew "starship"
brew "wget"
brew "ffmpeg"
brew "solargraph"  # for ruby lsp
brew "dive"  # container exploration
brew "imagemagick"
# cask "firefox"  # Easier to just install it myself for now

# 1password CLI, _not_ the GUI cask
tap "1password/tap"
cask "1password/tap/1password-cli"
# And now the actual GUI cask, which is seperate and has caused me issues:
cask "1password"
# mas "1Password 7", id: 1333542190  # 1password 7 via mac store if needed, but 8 is out now...
# ( See https://1password.com/mac-app-store-subscribe/ )

# nvim ale/lsp stuff
brew "shellcheck"
brew "shfmt"

# yadm (note: yadm will always be installed first as the first yadm bootstrap command necessarily requires a
# pre-existing yadm command)
brew "yadm"

# Stuff to be pretty
brew "cowsay"
brew "lolcat"
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"

#github integration
brew "gh"
brew "cmake"  # needed for a dependency, telescope-fzf-native.nvim

# Docker for Mac
# brew "docker"
# brew "docker-compose"
# cask "docker"

# Hashicorp Vault
tap "hashicorp/tap"
brew "hashicorp/tap/vault"

# prereqs and suggestions for nb
brew "pandoc"
brew "tig"
brew "w3m"
brew "nb"


