brew "ansible-lint"
brew "autoconf"
brew "automake"
brew "aws-vault"
brew "awscli"
brew "bat"
brew "blueutil"
brew "chezmoi"
brew "cmake"
brew "colima"
brew "croc"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "freetype"
brew "fzf"
brew "gcc"
brew "gd"
brew "gettext"
brew "gh"
brew "git"
brew "gmp"
brew "gpg"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "jsonlint"
brew "krb5"
brew "libedit"
brew "libiconv"
brew "libpng"
brew "libxml++"
brew "libxml2"
brew "libzip"
brew "mas"
brew "mise"
brew "neovim"
brew "oniguruma"
brew "openvpn"
brew "pipx"
brew "pkgconf"
brew "postgresql@13"
brew "prettyping"
brew "pulumi"
brew "pv"
brew "ripgrep"
brew "ripgrep"
brew "rsync"
brew "ruff"
brew "shfmt"
brew "starship"
brew "stylua"
brew "trash"
brew "tree-sitter-cli"
brew "yq"
brew "yq"
brew "zlib"
brew "zoxide"
cask "1password-cli"
cask "1password"
cask "aws-vpn-client"
cask "discord"
cask "docker-desktop"
cask "filebot"
cask "firefox"
cask "font-victor-mono-nerd-font"
cask "gimp"
cask "hammerspoon"
cask "iterm2"
cask "mactex-no-gui"
cask "makemkv"
cask "obsidian"
cask "plex-media-server"
cask "plex"
cask "session-manager-plugin"
cask "slack"
cask "steam"
cask "todoist-app"
cask "tunnelblick"
cask "wezterm"
cask "zoom"
mas "Magnet", id: 441258766
tap "1password/tap"
tap "homebrew/bundle"
