fisherman/fzf
fisherman/git_util
fisherman/host_info
fisherman/humanize_duration
fisherman/last_job_id
fisherman/metro
fisherman/pwd_info
fisherman/pwd_is_home
fisherman/pyenv
fisherman/segment
tuvistavie/fish-ssh-agent
oh-my-fish/plugin-tmux
fisherman/z
